In [1]:
import numpy as np
import pandas as pd

### a. Kindly fill the missing values with value
### Statistical value
### Filling  method

### B) Create pivot table for  position and average salary.
### C) Group the data using group by as per gender  and average age.

In [2]:
df= pd.read_excel(r"C:\Users\subha\Downloads\ethnic_diversity.xlsx")

In [3]:
df

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...
305,"Daniele, Ann",1411071312,Sr. Network Engineer,CT,6033.0,F,Married,US Citizen,Leave of Absence,IT/IS,37619.01,38,White
306,"Lajiri, Jyoti",1108028108,Sr. Network Engineer,MA,2169.0,M,Married,US Citizen,Leave of Absence,IT/IS,27603.00,34,White
307,"Semizoglou, Jeremiah",904013591,Sr. Network Engineer,MA,1545.0,M,Married,US Citizen,Future Start,IT/IS,27587.46,24,Asian
308,"South, Joe",1308060959,Sr. Network Engineer,CT,6278.0,M,Single,US Citizen,Active,IT/IS,12126.53,31,White
309,"Warfield, Sarah",1301052347,Sr. Network Engineer,MA,2453.0,F,Widowed,US Citizen,Active,IT/IS,37257.00,46,Asian

In [4]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

## Position

In [5]:
df[df['Position'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
91,"Desimone, Carl",1501072124,NaN,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
95,"Kirill, Alexandra",903013071,NaN,MA,2127.0,F,Married,US Citizen,Voluntarily Terminated,Production,37619.00,44,White
151,"Engdahl, Jean",1007020403,NaN,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [7]:
df['Position'].fillna('Data Scientist',inplace = True)  ## value

In [8]:
df['Position'][91]

'Data Scientist'

In [9]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [10]:
df[df['State'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
81,"Liebig, Ketsia",1103024679,Production Manager,NaN,2110.0,F,Married,US Citizen,Active,Production,28520.00,35,White
151,"Engdahl, Jean",1007020403,Data Scientist,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [12]:
df['State'].mode()  ## statistical method

0    MA
Name: State, dtype: object

In [14]:
df['State'].fillna(df['State'].mode()[0],inplace = True)

In [15]:
df['State'][81]

'MA'

In [16]:
df['State'][151]

'MA'

In [17]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### Zip

In [18]:
df[df['Zip'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
83,"Peterson, Ebonee",1402065355,Production Manager,MA,NaN,F,Married,US Citizen,Voluntarily Terminated,Production,37487.05,27,White
146,"Sutwell, Barbara",1407069061,Production Technician I,MA,NaN,NaN,Single,Eligible NonCitizen,Active,Production,22626.11,45,Asian

In [19]:
df['Zip'].fillna(method = 'bfill',inplace = True)

In [20]:
df['Zip'][83]

2451.0

In [21]:
df['Zip'][146]

1887.0

In [22]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

## Gender

In [23]:
df[df['Gender'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
26,"Martins, Joseph",1209048771,Area Sales Manager,TX,78207.0,NaN,Single,Eligible NonCitizen,Active,Sales,30817.00,45,Black or African American
146,"Sutwell, Barbara",1407069061,Production Technician I,MA,1887.0,NaN,Single,Eligible NonCitizen,Active,Production,22626.11,45,Asian
150,"Cornett, Lisa",1403066069,Production Technician I,MA,2189.0,NaN,Married,US Citizen,Active,Production,33801.00,24,White
166,"Dickinson, Geoff",706006285,Production Technician I,MA,2180.0,NaN,Single,US Citizen,Active,Production,5325.51,23,White
186,"Mckenna, Sandy",909015167,Production Technician I,MA,2184.0,NaN,Married,US Citizen,Active,Production,55226.80,46,Black or African American
202,"Linares, Marilyn",1206042315,Production Technician I,MA,1886.0,NaN,Married,US Citizen,Voluntarily Terminated,Production,35448.62,49,White
216,"Kinsella, Kathleen",710007401,Production Technician I,MA,2170.0,NaN,NaN,US Citizen,Voluntarily Terminated,Production,108304.00,27,White

In [24]:
df['Gender'].mode()  ## statistical method

0    F
Name: Gender, dtype: object

In [25]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace = True)

In [26]:
df['Gender'][26]

'F'

In [27]:
df['Gender'][166]

'F'

In [28]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

## MaritalDesc

In [29]:
df[df['MaritalDesc'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
32,"Terry, Sharlene",1401064637,Area Sales Manager,OR,97756.0,F,NaN,US Citizen,Active,Sales,36485.25,49,Black or African American
48,"Roby, Lori",1407068885,Data Analyst,MA,1886.0,F,NaN,US Citizen,Active,IT/IS,22721.00,23,White
70,"Shepard, Anita",906014183,Network Engineer,MA,1773.0,F,NaN,US Citizen,Active,IT/IS,27588.40,30,White
91,"Desimone, Carl",1501072124,Data Scientist,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
112,"Ngodup, Shari",1403066020,Production Technician I,MA,1810.0,F,NaN,US Citizen,Active,Production,66142.11,27,Asian
134,"Beatrice, Courtney",1403066194,Production Technician I,MA,1915.0,F,NaN,Eligible NonCitizen,Active,Production,NaN,44,White
161,"Stoica, Rick",1106026896,Production Technician I,MA,2301.0,M,NaN,US Citizen,Active,Production,47548.01,34,Asian
189,"Purinton, Janine",1011022926,Production Technician I,MA,2474.0,F,NaN,US Citizen,Voluntarily Terminated,Production,2250.00,27,White
216,"Kinsella, Kathleen",710007401,Production Technician I,MA,2170.0,F,NaN,US Citizen,Voluntarily Terminated,Production,108304.00,27,White

In [31]:
df['MaritalDesc'].fillna(method = 'ffill',inplace = True)

In [32]:
df['MaritalDesc'][48]

'Married'

In [33]:
df['MaritalDesc'][32]

'Separated'

In [34]:
df['MaritalDesc'][70]

'Married'

In [35]:
df['MaritalDesc'][91]

'Single'

In [36]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

## CitizenDesc

In [37]:
df[df['CitizenDesc'].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
19,"Villanueva, Noah",1111030503,Area Sales Manager,ME,4063.0,M,Single,NaN,Active,Sales,25521.82,25,Asian
29,"Onque, Jasmine",1501072180,Area Sales Manager,FL,33174.0,F,Single,NaN,Active,Sales,53196.72,38,White
88,"Anderson, Linda",1304055947,Production Technician I,MA,1844.0,F,Single,NaN,Active,Production,49500.00,25,White

In [38]:
df['CitizenDesc'].fillna('India',inplace = True)

In [39]:
df['CitizenDesc'][19]

'India'

In [40]:
df['CitizenDesc'][29]

'India'

In [41]:
df['CitizenDesc'][88]

'India'

In [42]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

## B) Create pivot table for position and average salary.

In [43]:
df.pivot_table(values =  "Salaries",columns = "Position",aggfunc = "mean")

Position,Accountant I,Administrative Assistant,Area Sales Manager,BI Developer,BI Director,CIO,Data Analyst,Data Analyst,Data Architect,Data Scientist,...,Production Technician I,Production Technician II,Sales Manager,Senior BI Developer,Shared Services Manager,Software Engineer,Software Engineering Manager,Sr. Accountant,Sr. DBA,Sr. Network Engineer
Salaries,674.28,46747.685,42048.275769,37449.776667,4160.0,26418.01,37772.945714,42304.75,90016.01,34387.906667,...,35136.340787,33803.863333,34093.246667,71293.676667,45262.975,39892.308889,40208.0,27349.755,31954.975,28438.6

## C) Group the data using group by as per gender and average age

In [44]:
df.groupby(by = 'Gender')["age"].mean()

Gender
F     38.670391
M     38.732824
Name: age, dtype: float64